zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K342_K341_K322_100HDQFP-pinctrl.h
/*
 * Copyright 2026 NXP
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on S32K344_K324_K314_257BGA-pinctrl.h with this part's differences applied
 * below (1057 removed, 0 changed,
 * 22 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 12f8105ca85c6145
 */

#ifndef _ZEPHYR_DTS_BINDING_S32K342_K341_K322_100HDQFP_WRAPPER_
#define _ZEPHYR_DTS_BINDING_S32K342_K341_K322_100HDQFP_WRAPPER_

#include "S32K344_K324_K314_257BGA-pinctrl.h"

/* Signals not present on this part */
#undef PTA0_LPSPI4_PCS2_I
#undef PTA0_LPSPI4_PCS2_O
#undef PTA12_LPUART11_RX
#undef PTA13_LPUART11_TX_I
#undef PTA13_LPUART11_TX_O
#undef PTA14_EMIOS_2_CH18_Y_I
#undef PTA14_EMIOS_2_CH18_Y_O
#undef PTA14_LPSPI5_PCS1_I
#undef PTA14_LPSPI5_PCS1_O
#undef PTA15_LPSPI5_PCS0_I
#undef PTA15_LPSPI5_PCS0_O
#undef PTA15_LPUART6_RX
#undef PTA16_LPSPI4_PCS3_I
#undef PTA16_LPSPI4_PCS3_O
#undef PTA16_LPUART6_TX_I
#undef PTA16_LPUART6_TX_O
#undef PTA17_EMIOS_0_CH6_G_I
#undef PTA17_EMIOS_0_CH6_G_O
#undef PTA17_FXIO_D19_I
#undef PTA17_FXIO_D19_O
#undef PTA17_LPSPI3_SOUT_I
#undef PTA17_LPSPI3_SOUT_O
#undef PTA17_LPUART4_TX_I
#undef PTA17_LPUART4_TX_O
#undef PTA18_EIRQ0
#undef PTA18_EMIOS_1_CH0_X_I
#undef PTA18_EMIOS_1_CH0_X_O
#undef PTA18_EMIOS_1_CH16_X_I
#undef PTA18_EMIOS_1_CH16_X_O
#undef PTA18_EMIOS_2_CH0_X_I
#undef PTA18_EMIOS_2_CH0_X_O
#undef PTA18_LPSPI1_SOUT_I
#undef PTA18_LPSPI1_SOUT_O
#undef PTA18_LPUART1_TX_I
#undef PTA18_LPUART1_TX_O
#undef PTA18_TRGMUX_IN12
#undef PTA19_EIRQ1
#undef PTA19_EMIOS_1_CH1_H_I
#undef PTA19_EMIOS_1_CH1_H_O
#undef PTA19_EMIOS_2_CH1_H_I
#undef PTA19_EMIOS_2_CH1_H_O
#undef PTA19_LPSPI1_SCK_I
#undef PTA19_LPSPI1_SCK_O
#undef PTA19_LPUART1_RX
#undef PTA19_TRGMUX_IN13
#undef PTA1_LPSPI4_PCS1_I
#undef PTA1_LPSPI4_PCS1_O
#undef PTA20_EIRQ2
#undef PTA20_EMIOS_1_CH2_H_I
#undef PTA20_EMIOS_1_CH2_H_O
#undef PTA20_EMIOS_2_CH2_H_I
#undef PTA20_EMIOS_2_CH2_H_O
#undef PTA20_LPSPI1_SIN_I
#undef PTA20_LPSPI1_SIN_O
#undef PTA20_TRGMUX_IN14
#undef PTA21_EIRQ3
#undef PTA21_EMIOS_1_CH3_H_I
#undef PTA21_EMIOS_1_CH3_H_O
#undef PTA21_EMIOS_2_CH3_H_I
#undef PTA21_EMIOS_2_CH3_H_O
#undef PTA21_FXIO_D0_I
#undef PTA21_FXIO_D0_O
#undef PTA21_LPSPI1_PCS0_I
#undef PTA21_LPSPI1_PCS0_O
#undef PTA21_LPSPI2_PCS2_I
#undef PTA21_LPSPI2_PCS2_O
#undef PTA21_TRGMUX_IN15
#undef PTA22_CAN1_RX
#undef PTA22_EMIOS_1_CH4_H_I
#undef PTA22_EMIOS_1_CH4_H_O
#undef PTA22_FXIO_D1_I
#undef PTA22_FXIO_D1_O
#undef PTA22_LPSPI1_PCS1_I
#undef PTA22_LPSPI1_PCS1_O
#undef PTA23_CAN1_TX
#undef PTA23_EMIOS_1_CH6_H_I
#undef PTA23_EMIOS_1_CH6_H_O
#undef PTA23_FXIO_D2_I
#undef PTA23_FXIO_D2_O
#undef PTA24_EMIOS_1_CH7_H
#undef PTA24_FXIO_D3
#undef PTA24_GPI24
#undef PTA25_EIRQ5
#undef PTA25_EMIOS_1_CH8_X
#undef PTA25_EMIOS_2_CH8_X
#undef PTA25_FXIO_D2
#undef PTA25_GPI25
#undef PTA26_EMAC_PPS0_I
#undef PTA26_EMAC_PPS0_O
#undef PTA26_EMIOS_1_CH9_H_I
#undef PTA26_EMIOS_1_CH9_H_O
#undef PTA26_EMIOS_2_CH9_H_I
#undef PTA26_EMIOS_2_CH9_H_O
#undef PTA26_FXIO_D1_I
#undef PTA26_FXIO_D1_O
#undef PTA26_LPSPI0_PCS0_I
#undef PTA26_LPSPI0_PCS0_O
#undef PTA26_LPSPI1_PCS0_I
#undef PTA26_LPSPI1_PCS0_O
#undef PTA27_CAN0_TX
#undef PTA27_EMAC_PPS1_I
#undef PTA27_EMAC_PPS1_O
#undef PTA27_EMIOS_1_CH10_H_I
#undef PTA27_EMIOS_1_CH10_H_O
#undef PTA27_EMIOS_2_CH10_H_I
#undef PTA27_EMIOS_2_CH10_H_O
#undef PTA27_FXIO_D5_I
#undef PTA27_FXIO_D5_O
#undef PTA27_LPUART0_TX_I
#undef PTA27_LPUART0_TX_O
#undef PTA28_CAN0_RX
#undef PTA28_EIRQ6
#undef PTA28_EMIOS_1_CH11_H_I
#undef PTA28_EMIOS_1_CH11_H_O
#undef PTA28_EMIOS_2_CH11_H_I
#undef PTA28_EMIOS_2_CH11_H_O
#undef PTA28_LPSPI1_SCK_I
#undef PTA28_LPSPI1_SCK_O
#undef PTA28_LPUART0_RX
#undef PTA29_EMAC_PPS2_I
#undef PTA29_EMAC_PPS2_O
#undef PTA29_EMIOS_1_CH12_H_I
#undef PTA29_EMIOS_1_CH12_H_O
#undef PTA29_EMIOS_2_CH12_H_I
#undef PTA29_EMIOS_2_CH12_H_O
#undef PTA29_LPSPI1_SIN_I
#undef PTA29_LPSPI1_SIN_O
#undef PTA29_LPUART2_TX_I
#undef PTA29_LPUART2_TX_O
#undef PTA2_LPSPI5_SIN_I
#undef PTA2_LPSPI5_SIN_O
#undef PTA30_EIRQ7
#undef PTA30_EMIOS_1_CH13_H_I
#undef PTA30_EMIOS_1_CH13_H_O
#undef PTA30_EMIOS_2_CH13_H_I
#undef PTA30_EMIOS_2_CH13_H_O
#undef PTA30_LPSPI0_SOUT_I
#undef PTA30_LPSPI0_SOUT_O
#undef PTA30_LPSPI1_SOUT_I
#undef PTA30_LPSPI1_SOUT_O
#undef PTA30_LPUART2_RX
#undef PTA31_EMIOS_1_CH14_H_I
#undef PTA31_EMIOS_1_CH14_H_O
#undef PTA31_FXIO_D0_I
#undef PTA31_FXIO_D0_O
#undef PTA31_LPSPI0_PCS1_I
#undef PTA31_LPSPI0_PCS1_O
#undef PTA31_TRGMUX_OUT8
#undef PTA3_LPSPI5_SCK_I
#undef PTA3_LPSPI5_SCK_O
#undef PTA8_EMIOS_2_CH7_H_I
#undef PTA8_EMIOS_2_CH7_H_O
#undef PTA9_CMP2_OUT
#undef PTB10_LPSPI4_SCK_I
#undef PTB10_LPSPI4_SCK_O
#undef PTB10_LPUART9_TX_I
#undef PTB10_LPUART9_TX_O
#undef PTB11_LPSPI4_SIN_I
#undef PTB11_LPSPI4_SIN_O
#undef PTB12_LPUART8_RX
#undef PTB13_LPUART8_TX_I
#undef PTB13_LPUART8_TX_O
#undef PTB14_LPUART7_RX
#undef PTB15_LPUART7_TX_I
#undef PTB15_LPUART7_TX_O
#undef PTB16_LPUART4_TX_I
#undef PTB16_LPUART4_TX_O
#undef PTB17_LPUART4_RX
#undef PTB18_EMIOS_1_CH15_H_I
#undef PTB18_EMIOS_1_CH15_H_O
#undef PTB18_EMIOS_2_CH14_H_I
#undef PTB18_EMIOS_2_CH14_H_O
#undef PTB18_FXIO_D1_I
#undef PTB18_FXIO_D1_O
#undef PTB18_LPSPI1_PCS1_I
#undef PTB18_LPSPI1_PCS1_O
#undef PTB18_LPUART13_TX_I
#undef PTB18_LPUART13_TX_O
#undef PTB18_TRGMUX_OUT9
#undef PTB19_EMIOS_1_CH15_H_I
#undef PTB19_EMIOS_1_CH15_H_O
#undef PTB19_EMIOS_2_CH15_H_I
#undef PTB19_EMIOS_2_CH15_H_O
#undef PTB19_FXIO_D2_I
#undef PTB19_FXIO_D2_O
#undef PTB19_LPUART13_RX
#undef PTB19_TRGMUX_OUT10
#undef PTB20_EMIOS_1_CH16_X_I
#undef PTB20_EMIOS_1_CH16_X_O
#undef PTB20_EMIOS_2_CH16_X_I
#undef PTB20_EMIOS_2_CH16_X_O
#undef PTB20_FXIO_D3_I
#undef PTB20_FXIO_D3_O
#undef PTB20_LPUART14_TX_I
#undef PTB20_LPUART14_TX_O
#undef PTB20_TRGMUX_OUT11
#undef PTB21_EIRQ8
#undef PTB21_EMIOS_1_CH17_Y_I
#undef PTB21_EMIOS_1_CH17_Y_O
#undef PTB21_EMIOS_2_CH17_Y_I
#undef PTB21_EMIOS_2_CH17_Y_O
#undef PTB21_FXIO_D4_I
#undef PTB21_FXIO_D4_O
#undef PTB21_LPUART14_RX
#undef PTB21_TRGMUX_OUT12
#undef PTB22_CAN1_TX
#undef PTB22_EIRQ9
#undef PTB22_EMAC_MII_CRS
#undef PTB22_EMIOS_1_CH18_Y_I
#undef PTB22_EMIOS_1_CH18_Y_O
#undef PTB22_EMIOS_2_CH18_Y_I
#undef PTB22_EMIOS_2_CH18_Y_O
#undef PTB22_FXIO_D15_I
#undef PTB22_FXIO_D15_O
#undef PTB22_LPSPI3_PCS1_I
#undef PTB22_LPSPI3_PCS1_O
#undef PTB22_LPUART1_TX_I
#undef PTB22_LPUART1_TX_O
#undef PTB22_TRGMUX_OUT13
#undef PTB23_ADC1_MA0
#undef PTB23_CAN1_RX
#undef PTB23_EIRQ10
#undef PTB23_EMAC_MII_COL
#undef PTB23_EMIOS_1_CH19_Y_I
#undef PTB23_EMIOS_1_CH19_Y_O
#undef PTB23_EMIOS_2_CH19_Y_I
#undef PTB23_EMIOS_2_CH19_Y_O
#undef PTB23_FXIO_D4_I
#undef PTB23_FXIO_D4_O
#undef PTB23_LPUART1_RX
#undef PTB23_TRGMUX_OUT14
#undef PTB24_ADC1_MA1
#undef PTB24_EIRQ11
#undef PTB24_EMIOS_1_CH20_Y_I
#undef PTB24_EMIOS_1_CH20_Y_O
#undef PTB24_EMIOS_2_CH20_Y_I
#undef PTB24_EMIOS_2_CH20_Y_O
#undef PTB24_FXIO_D5_I
#undef PTB24_FXIO_D5_O
#undef PTB25_EIRQ12
#undef PTB25_EMIOS_1_CH21_Y_I
#undef PTB25_EMIOS_1_CH21_Y_O
#undef PTB25_EMIOS_2_CH21_Y_I
#undef PTB25_EMIOS_2_CH21_Y_O
#undef PTB25_FXIO_D6_I
#undef PTB25_FXIO_D6_O
#undef PTB25_LPSPI2_PCS0_I
#undef PTB25_LPSPI2_PCS0_O
#undef PTB25_LPUART15_TX_I
#undef PTB25_LPUART15_TX_O
#undef PTB26_EIRQ13
#undef PTB26_EMIOS_1_CH22_X_I
#undef PTB26_EMIOS_1_CH22_X_O
#undef PTB26_EMIOS_2_CH22_X_I
#undef PTB26_EMIOS_2_CH22_X_O
#undef PTB26_FXIO_D7_I
#undef PTB26_FXIO_D7_O
#undef PTB26_LPUART15_RX
#undef PTB27_EMIOS_1_CH23_X_I
#undef PTB27_EMIOS_1_CH23_X_O
#undef PTB27_EMIOS_2_CH23_X_I
#undef PTB27_EMIOS_2_CH23_X_O
#undef PTB27_FXIO_D8_I
#undef PTB27_FXIO_D8_O
#undef PTB27_LPSPI2_SOUT_I
#undef PTB27_LPSPI2_SOUT_O
#undef PTB27_LPUART5_TX_I
#undef PTB27_LPUART5_TX_O
#undef PTB28_ADC1_MA2
#undef PTB28_EIRQ14
#undef PTB28_EMAC_PPS3_I
#undef PTB28_EMAC_PPS3_O
#undef PTB28_EMIOS_2_CH10_H_I
#undef PTB28_EMIOS_2_CH10_H_O
#undef PTB28_FXIO_D9_I
#undef PTB28_FXIO_D9_O
#undef PTB28_LCU1_OUT11
#undef PTB28_LPSPI2_SIN_I
#undef PTB28_LPSPI2_SIN_O
#undef PTB28_LPUART5_RX
#undef PTB29_EMIOS_2_CH11_H_I
#undef PTB29_EMIOS_2_CH11_H_O
#undef PTB29_FXIO_D10_I
#undef PTB29_FXIO_D10_O
#undef PTB29_LCU1_OUT10
#undef PTB29_LPSPI2_SCK_I
#undef PTB29_LPSPI2_SCK_O
#undef PTB29_LPUART6_TX_I
#undef PTB29_LPUART6_TX_O
#undef PTB29_SAI0_D1_I
#undef PTB29_SAI0_D1_O
#undef PTB2_CAN4_RX
#undef PTB2_LPUART9_RX
#undef PTB30_FXIO_D11_I
#undef PTB30_FXIO_D11_O
#undef PTB30_HSE_TAMPER_LOOP_OUT0
#undef PTB31_EIRQ15
#undef PTB31_HSE_TAMPER_EXTIN0
#undef PTB3_CAN4_TX
#undef PTB3_LPUART9_TX_I
#undef PTB3_LPUART9_TX_O
#undef PTB8_LPSPI4_PCS0_I
#undef PTB8_LPSPI4_PCS0_O
#undef PTB9_LPSPI4_SOUT_I
#undef PTB9_LPSPI4_SOUT_O
#undef PTB9_LPUART9_RX
#undef PTC10_CAN5_TX
#undef PTC10_LPSPI4_PCS0_I
#undef PTC10_LPSPI4_PCS0_O
#undef PTC10_LPUART11_TX_I
#undef PTC10_LPUART11_TX_O
#undef PTC11_CAN5_RX
#undef PTC11_LPSPI4_SOUT_I
#undef PTC11_LPSPI4_SOUT_O
#undef PTC11_LPUART11_RX
#undef PTC12_LPUART10_RX
#undef PTC13_LPUART10_TX_I
#undef PTC13_LPUART10_TX_O
#undef PTC16_EMIOS_2_CH9_H_I
#undef PTC16_EMIOS_2_CH9_H_O
#undef PTC18_EMIOS_2_CH12_H_I
#undef PTC18_EMIOS_2_CH12_H_O
#undef PTC18_FXIO_D12_I
#undef PTC18_FXIO_D12_O
#undef PTC18_FXIO_D6_I
#undef PTC18_FXIO_D6_O
#undef PTC18_LCU1_OUT7
#undef PTC18_LPUART6_RX
#undef PTC18_SAI0_D2_I
#undef PTC18_SAI0_D2_O
#undef PTC19_EMIOS_2_CH13_H_I
#undef PTC19_EMIOS_2_CH13_H_O
#undef PTC19_FXIO_D13_I
#undef PTC19_FXIO_D13_O
#undef PTC19_LCU1_OUT6
#undef PTC19_LPSPI2_PCS1_I
#undef PTC19_LPSPI2_PCS1_O
#undef PTC19_LPUART7_TX_I
#undef PTC19_LPUART7_TX_O
#undef PTC19_SAI0_D3_I
#undef PTC19_SAI0_D3_O
#undef PTC20_ADC1_MA2
#undef PTC20_EIRQ16
#undef PTC20_EMIOS_2_CH14_H_I
#undef PTC20_EMIOS_2_CH14_H_O
#undef PTC20_FXIO_D14_I
#undef PTC20_FXIO_D14_O
#undef PTC20_LCU1_OUT5
#undef PTC20_LPUART7_RX
#undef PTC21_ADC1_MA1
#undef PTC21_EIRQ17
#undef PTC21_EMIOS_2_CH15_H_I
#undef PTC21_EMIOS_2_CH15_H_O
#undef PTC21_FXIO_D15_I
#undef PTC21_FXIO_D15_O
#undef PTC21_LCU1_OUT4
#undef PTC22_EMIOS_0_CH8_X_I
#undef PTC22_EMIOS_0_CH8_X_O
#undef PTC23_EIRQ18
#undef PTC23_FXIO_D16_I
#undef PTC23_FXIO_D16_O
#undef PTC23_LCU1_OUT0
#undef PTC24_EIRQ19
#undef PTC24_EMIOS_1_CH0_X_I
#undef PTC24_EMIOS_1_CH0_X_O
#undef PTC24_EMIOS_2_CH0_X_I
#undef PTC24_EMIOS_2_CH0_X_O
#undef PTC24_FXIO_D17_I
#undef PTC24_FXIO_D17_O
#undef PTC24_LCU1_OUT1
#undef PTC24_LPUART12_TX_I
#undef PTC24_LPUART12_TX_O
#undef PTC24_TRGMUX_OUT15
#undef PTC25_EIRQ20
#undef PTC25_EMIOS_1_CH1_H_I
#undef PTC25_EMIOS_1_CH1_H_O
#undef PTC25_EMIOS_2_CH1_H_I
#undef PTC25_EMIOS_2_CH1_H_O
#undef PTC25_FXIO_D18_I
#undef PTC25_FXIO_D18_O
#undef PTC25_LCU1_OUT2
#undef PTC25_LPSPI4_PCS1_I
#undef PTC25_LPSPI4_PCS1_O
#undef PTC25_LPUART12_RX
#undef PTC26_CAN5_RX
#undef PTC26_EIRQ21
#undef PTC26_EMIOS_1_CH3_H_I
#undef PTC26_EMIOS_1_CH3_H_O
#undef PTC26_EMIOS_2_CH2_H_I
#undef PTC26_EMIOS_2_CH2_H_O
#undef PTC26_FXIO_D19_I
#undef PTC26_FXIO_D19_O
#undef PTC26_LCU1_OUT9
#undef PTC26_LPSPI4_SIN_I
#undef PTC26_LPSPI4_SIN_O
#undef PTC26_LPUART13_TX_I
#undef PTC26_LPUART13_TX_O
#undef PTC27_ADC1_MA0
#undef PTC27_CAN5_TX
#undef PTC27_EIRQ22
#undef PTC27_EMIOS_1_CH4_H_I
#undef PTC27_EMIOS_1_CH4_H_O
#undef PTC27_EMIOS_2_CH3_H_I
#undef PTC27_EMIOS_2_CH3_H_O
#undef PTC27_FXIO_D20_I
#undef PTC27_FXIO_D20_O
#undef PTC27_LCU1_OUT3
#undef PTC27_LPSPI4_SCK_I
#undef PTC27_LPSPI4_SCK_O
#undef PTC27_LPUART13_RX
#undef PTC28_CAN3_TX
#undef PTC28_EMIOS_1_CH7_H_I
#undef PTC28_EMIOS_1_CH7_H_O
#undef PTC28_FXIO_D21_I
#undef PTC28_FXIO_D21_O
#undef PTC28_FXIO_D2_I
#undef PTC28_FXIO_D2_O
#undef PTC28_LCU1_OUT8
#undef PTC28_LPI2C1_SCL_I
#undef PTC28_LPI2C1_SCL_O
#undef PTC29_CAN3_RX
#undef PTC29_EIRQ23
#undef PTC29_EMIOS_1_CH10_H_I
#undef PTC29_EMIOS_1_CH10_H_O
#undef PTC29_EMIOS_2_CH4_H_I
#undef PTC29_EMIOS_2_CH4_H_O
#undef PTC29_FXIO_D22_I
#undef PTC29_FXIO_D22_O
#undef PTC29_FXIO_D3_I
#undef PTC29_FXIO_D3_O
#undef PTC29_LPI2C1_SDA_I
#undef PTC29_LPI2C1_SDA_O
#undef PTC2_TRACE_ETM_CLKOUT
#undef PTC30_CAN4_TX
#undef PTC30_EMIOS_1_CH12_H_I
#undef PTC30_EMIOS_1_CH12_H_O
#undef PTC30_EMIOS_2_CH5_H_I
#undef PTC30_EMIOS_2_CH5_H_O
#undef PTC30_FXIO_D0_I
#undef PTC30_FXIO_D0_O
#undef PTC30_FXIO_D23_I
#undef PTC30_FXIO_D23_O
#undef PTC31_CAN4_RX
#undef PTC31_EMIOS_1_CH14_H_I
#undef PTC31_EMIOS_1_CH14_H_O
#undef PTC31_EMIOS_2_CH6_H_I
#undef PTC31_EMIOS_2_CH6_H_O
#undef PTC31_FXIO_D1_I
#undef PTC31_FXIO_D1_O
#undef PTC31_FXIO_D24_I
#undef PTC31_FXIO_D24_O
#undef PTC5_CMP2_RR_ACTIVE
#undef PTD0_LPUART5_RX
#undef PTD10_TRACE_ETM_D3
#undef PTD11_TRACE_ETM_D2
#undef PTD12_TRACE_ETM_D1
#undef PTD13_EIRQ29
#undef PTD13_EMAC_PPS1_I
#undef PTD13_EMAC_PPS1_O
#undef PTD13_EMIOS_0_CH20_Y_I
#undef PTD13_EMIOS_0_CH20_Y_O
#undef PTD13_FXIO_D7_I
#undef PTD13_FXIO_D7_O
#undef PTD13_LPI2C0_SDA_I
#undef PTD13_LPI2C0_SDA_O
#undef PTD13_LPSPI5_SIN_I
#undef PTD13_LPSPI5_SIN_O
#undef PTD13_LPUART1_RX
#undef PTD13_SAI1_D0_I
#undef PTD13_SAI1_D0_O
#undef PTD14_CLKOUT_RUN
#undef PTD14_CMP0_RR_ACTIVE
#undef PTD14_EIRQ30
#undef PTD14_EMAC_PPS0_I
#undef PTD14_EMAC_PPS0_O
#undef PTD14_EMIOS_0_CH21_Y_I
#undef PTD14_EMIOS_0_CH21_Y_O
#undef PTD14_LPI2C0_SCL_I
#undef PTD14_LPI2C0_SCL_O
#undef PTD14_LPSPI5_SCK_I
#undef PTD14_LPSPI5_SCK_O
#undef PTD14_LPUART1_TX_I
#undef PTD14_LPUART1_TX_O
#undef PTD14_SAI1_MCLK
#undef PTD15_LPUART8_RX
#undef PTD16_LPUART8_TX_I
#undef PTD16_LPUART8_TX_O
#undef PTD17_CAN5_RX
#undef PTD17_LPSPI5_PCS0_I
#undef PTD17_LPSPI5_PCS0_O
#undef PTD18_CAN2_TX
#undef PTD18_EMIOS_1_CH15_H_I
#undef PTD18_EMIOS_1_CH15_H_O
#undef PTD18_FXIO_D2_I
#undef PTD18_FXIO_D2_O
#undef PTD19_CAN2_RX
#undef PTD19_EMIOS_1_CH16_X_I
#undef PTD19_EMIOS_1_CH16_X_O
#undef PTD19_FXIO_D3_I
#undef PTD19_FXIO_D3_O
#undef PTD1_LPUART5_TX_I
#undef PTD1_LPUART5_TX_O
#undef PTD20_EIRQ25
#undef PTD20_EMIOS_1_CH17_Y_I
#undef PTD20_EMIOS_1_CH17_Y_O
#undef PTD20_EMIOS_2_CH0_X_I
#undef PTD20_EMIOS_2_CH0_X_O
#undef PTD20_FXIO_D25_I
#undef PTD20_FXIO_D25_O
#undef PTD20_LPSPI1_PCS2_I
#undef PTD20_LPSPI1_PCS2_O
#undef PTD20_LPSPI3_SIN_I
#undef PTD20_LPSPI3_SIN_O
#undef PTD21_EIRQ26
#undef PTD21_EMIOS_1_CH18_Y_I
#undef PTD21_EMIOS_1_CH18_Y_O
#undef PTD21_EMIOS_2_CH8_X_I
#undef PTD21_EMIOS_2_CH8_X_O
#undef PTD21_FXIO_D26_I
#undef PTD21_FXIO_D26_O
#undef PTD21_LCU0_OUT4
#undef PTD22_EIRQ27
#undef PTD22_EMIOS_1_CH19_Y_I
#undef PTD22_EMIOS_1_CH19_Y_O
#undef PTD22_EMIOS_2_CH22_X_I
#undef PTD22_EMIOS_2_CH22_X_O
#undef PTD22_FXIO_D27_I
#undef PTD22_FXIO_D27_O
#undef PTD22_LCU0_OUT5
#undef PTD23_EIRQ28
#undef PTD23_EMIOS_1_CH20_Y_I
#undef PTD23_EMIOS_1_CH20_Y_O
#undef PTD23_EMIOS_2_CH23_X_I
#undef PTD23_EMIOS_2_CH23_X_O
#undef PTD23_FXIO_D28_I
#undef PTD23_FXIO_D28_O
#undef PTD23_HSE_TAMPER_LOOP_OUT0
#undef PTD23_LCU0_OUT10
#undef PTD24_EIRQ29
#undef PTD24_EMIOS_1_CH21_Y_I
#undef PTD24_EMIOS_1_CH21_Y_O
#undef PTD24_FXIO_D29_I
#undef PTD24_FXIO_D29_O
#undef PTD24_HSE_TAMPER_EXTIN0
#undef PTD24_LCU0_OUT11
#undef PTD25_EMIOS_1_CH22_X_I
#undef PTD25_EMIOS_1_CH22_X_O
#undef PTD26_EMIOS_1_CH23_X_I
#undef PTD26_EMIOS_1_CH23_X_O
#undef PTD26_EMIOS_2_CH7_H_I
#undef PTD26_EMIOS_2_CH7_H_O
#undef PTD26_FXIO_D30_I
#undef PTD26_FXIO_D30_O
#undef PTD26_FXIO_D7_I
#undef PTD26_FXIO_D7_O
#undef PTD26_LCU0_OUT0
#undef PTD26_LPSPI5_SCK_I
#undef PTD26_LPSPI5_SCK_O
#undef PTD26_LPUART14_TX_I
#undef PTD26_LPUART14_TX_O
#undef PTD27_EIRQ30
#undef PTD27_EMIOS_2_CH9_H_I
#undef PTD27_EMIOS_2_CH9_H_O
#undef PTD27_FXIO_D31_I
#undef PTD27_FXIO_D31_O
#undef PTD27_LCU0_OUT1
#undef PTD27_LPSPI5_SOUT_I
#undef PTD27_LPSPI5_SOUT_O
#undef PTD27_LPUART14_RX
#undef PTD28_EIRQ31
#undef PTD28_EMIOS_2_CH0_X_I
#undef PTD28_EMIOS_2_CH0_X_O
#undef PTD28_LCU0_OUT2
#undef PTD28_LPSPI5_SIN_I
#undef PTD28_LPSPI5_SIN_O
#undef PTD28_LPUART15_TX_I
#undef PTD28_LPUART15_TX_O
#undef PTD29_EMIOS_2_CH8_X_I
#undef PTD29_EMIOS_2_CH8_X_O
#undef PTD29_LCU0_OUT3
#undef PTD29_LPSPI5_PCS2_I
#undef PTD29_LPSPI5_PCS2_O
#undef PTD29_LPUART15_RX
#undef PTD2_LPSPI5_SOUT_I
#undef PTD2_LPSPI5_SOUT_O
#undef PTD30_EMIOS_2_CH16_X_I
#undef PTD30_EMIOS_2_CH16_X_O
#undef PTD30_LCU0_OUT8
#undef PTD30_LPSPI5_PCS3_I
#undef PTD30_LPSPI5_PCS3_O
#undef PTD31_EMIOS_2_CH22_X_I
#undef PTD31_EMIOS_2_CH22_X_O
#undef PTD31_FXIO_D6_I
#undef PTD31_FXIO_D6_O
#undef PTD31_LCU0_OUT9
#undef PTD4_LPSPI5_PCS0_I
#undef PTD4_LPSPI5_PCS0_O
#undef PTD7_TRACE_ETM_D0
#undef PTD8_LPUART6_RX
#undef PTD9_LPUART6_TX_I
#undef PTD9_LPUART6_TX_O
#undef PTE0_LPUART7_RX
#undef PTE10_LPUART4_RX
#undef PTE11_LPUART4_TX_I
#undef PTE11_LPUART4_TX_O
#undef PTE12_CAN5_TX
#undef PTE14_CAN4_RX
#undef PTE14_EIRQ13
#undef PTE14_EMAC_PPS1_I
#undef PTE14_EMAC_PPS1_O
#undef PTE14_EMIOS_0_CH19_Y_I
#undef PTE14_EMIOS_0_CH19_Y_O
#undef PTE14_FXIO_D7_I
#undef PTE14_FXIO_D7_O
#undef PTE14_LPUART5_TX_I
#undef PTE14_LPUART5_TX_O
#undef PTE17_EMIOS_2_CH23_X_I
#undef PTE17_EMIOS_2_CH23_X_O
#undef PTE17_FXIO_D5_I
#undef PTE17_FXIO_D5_O
#undef PTE18_EMIOS_2_CH17_Y_I
#undef PTE18_EMIOS_2_CH17_Y_O
#undef PTE18_FXIO_D4_I
#undef PTE18_FXIO_D4_O
#undef PTE19_EMIOS_0_CH22_X_I
#undef PTE19_EMIOS_0_CH22_X_O
#undef PTE1_LPUART7_TX_I
#undef PTE1_LPUART7_TX_O
#undef PTE20_EMIOS_1_CH0_X_I
#undef PTE20_EMIOS_1_CH0_X_O
#undef PTE21_EMIOS_1_CH1_H_I
#undef PTE21_EMIOS_1_CH1_H_O
#undef PTE21_EMIOS_2_CH19_Y_I
#undef PTE21_EMIOS_2_CH19_Y_O
#undef PTE21_LPSPI4_SIN_I
#undef PTE21_LPSPI4_SIN_O
#undef PTE22_EMIOS_1_CH2_H_I
#undef PTE22_EMIOS_1_CH2_H_O
#undef PTE22_EMIOS_2_CH20_Y_I
#undef PTE22_EMIOS_2_CH20_Y_O
#undef PTE22_LPSPI4_SCK_I
#undef PTE22_LPSPI4_SCK_O
#undef PTE23_EMIOS_1_CH3_H_I
#undef PTE23_EMIOS_1_CH3_H_O
#undef PTE23_EMIOS_2_CH21_Y_I
#undef PTE23_EMIOS_2_CH21_Y_O
#undef PTE23_LPSPI4_PCS0_I
#undef PTE23_LPSPI4_PCS0_O
#undef PTE24_CAN2_TX
#undef PTE24_EMIOS_1_CH4_H_I
#undef PTE24_EMIOS_1_CH4_H_O
#undef PTE24_EMIOS_2_CH4_H_I
#undef PTE24_EMIOS_2_CH4_H_O
#undef PTE24_FXIO_D11_I
#undef PTE24_FXIO_D11_O
#undef PTE24_FXIO_D5_I
#undef PTE24_FXIO_D5_O
#undef PTE24_LPSPI4_PCS1_I
#undef PTE24_LPSPI4_PCS1_O
#undef PTE25_CAN2_RX
#undef PTE25_EMIOS_1_CH5_H_I
#undef PTE25_EMIOS_1_CH5_H_O
#undef PTE25_EMIOS_2_CH5_H_I
#undef PTE25_EMIOS_2_CH5_H_O
#undef PTE25_LPSPI4_SOUT_I
#undef PTE25_LPSPI4_SOUT_O
#undef PTE26_EMIOS_1_CH6_H_I
#undef PTE26_EMIOS_1_CH6_H_O
#undef PTE26_EMIOS_2_CH6_H_I
#undef PTE26_EMIOS_2_CH6_H_O
#undef PTE27_EMIOS_1_CH7_H_I
#undef PTE27_EMIOS_1_CH7_H_O
#undef PTE28_CAN3_TX
#undef PTE29_CAN3_RX
#undef PTE2_LPUART10_RX
#undef PTE30_CAN4_TX
#undef PTE30_CMP1_OUT
#undef PTE31_CAN4_RX
#undef PTE31_CMP1_RR_ACTIVES
#undef PTE3_CAN4_TX
#undef PTE3_LPUART5_RX
#undef PTE4_EIRQ4
#undef PTE4_EMIOS_0_CH18_Y_I
#undef PTE4_EMIOS_0_CH18_Y_O
#undef PTE4_EMIOS_1_CH4_H_I
#undef PTE4_EMIOS_1_CH4_H_O
#undef PTE4_FXIO_D6_I
#undef PTE4_FXIO_D6_O
#undef PTE4_LPSPI0_PCS0_I
#undef PTE4_LPSPI0_PCS0_O
#undef PTE4_LPSPI1_PCS1_I
#undef PTE4_LPSPI1_PCS1_O
#undef PTE4_LPUART12_TX_I
#undef PTE4_LPUART12_TX_O
#undef PTE5_EIRQ5
#undef PTE5_EMIOS_0_CH19_Y_I
#undef PTE5_EMIOS_0_CH19_Y_O
#undef PTE5_EMIOS_1_CH5_H_I
#undef PTE5_EMIOS_1_CH5_H_O
#undef PTE5_FXIO_D7_I
#undef PTE5_FXIO_D7_O
#undef PTE5_LPUART12_RX
#undef PTE6_LPUART10_TX_I
#undef PTE6_LPUART10_TX_O
#undef PTE7_EMIOS_0_CH7_G_I
#undef PTE7_EMIOS_0_CH7_G_O
#undef PTE7_FXIO_D11_I
#undef PTE7_FXIO_D11_O
#undef PTE7_LPSPI3_SCK_I
#undef PTE7_LPSPI3_SCK_O
#undef PTE7_LPUART4_RX
#undef PTE8_LPSPI5_PCS1_I
#undef PTE8_LPSPI5_PCS1_O
#undef PTE9_LPSPI5_SOUT_I
#undef PTE9_LPSPI5_SOUT_O
#undef PTF0_EIRQ0
#undef PTF0_EMIOS_2_CH0_X_I
#undef PTF0_EMIOS_2_CH0_X_O
#undef PTF0_LPSPI2_SCK_I
#undef PTF0_LPSPI2_SCK_O
#undef PTF0_LPUART5_TX_I
#undef PTF0_LPUART5_TX_O
#undef PTF10_ADC0_MA1
#undef PTF10_EIRQ18
#undef PTF10_EMIOS_2_CH10_H_I
#undef PTF10_EMIOS_2_CH10_H_O
#undef PTF11_ADC0_MA2
#undef PTF11_EIRQ19
#undef PTF11_EMIOS_2_CH11_H_I
#undef PTF11_EMIOS_2_CH11_H_O
#undef PTF11_HSE_TAMPER_EXTIN0
#undef PTF12_ADC0_MA0
#undef PTF12_EIRQ20
#undef PTF12_EMIOS_2_CH12_H_I
#undef PTF12_EMIOS_2_CH12_H_O
#undef PTF12_LPSPI3_SIN_I
#undef PTF12_LPSPI3_SIN_O
#undef PTF12_LPUART10_TX_I
#undef PTF12_LPUART10_TX_O
#undef PTF13_ADC0_MA1
#undef PTF13_EIRQ21
#undef PTF13_EMIOS_2_CH13_H_I
#undef PTF13_EMIOS_2_CH13_H_O
#undef PTF13_LPSPI3_SCK_I
#undef PTF13_LPSPI3_SCK_O
#undef PTF13_LPUART10_RX
#undef PTF14_CAN1_TX
#undef PTF14_CMP0_OUT
#undef PTF14_EIRQ22
#undef PTF14_EMIOS_2_CH14_H_I
#undef PTF14_EMIOS_2_CH14_H_O
#undef PTF14_FCCU_ERR0
#undef PTF14_FCCU_ERR_IN0
#undef PTF14_FXIO_D3_I
#undef PTF14_FXIO_D3_O
#undef PTF15_CAN1_RX
#undef PTF15_CMP0_RR_ACTIVE
#undef PTF15_EIRQ23
#undef PTF15_EMIOS_2_CH15_H_I
#undef PTF15_EMIOS_2_CH15_H_O
#undef PTF15_FCCU_ERR1
#undef PTF15_FCCU_ERR_IN1
#undef PTF15_LPSPI3_SOUT_I
#undef PTF15_LPSPI3_SOUT_O
#undef PTF16_ADC1_MA0
#undef PTF16_EMIOS_1_CH0_X_I
#undef PTF16_EMIOS_1_CH0_X_O
#undef PTF16_EMIOS_2_CH16_X_I
#undef PTF16_EMIOS_2_CH16_X_O
#undef PTF16_LPSPI3_PCS0_I
#undef PTF16_LPSPI3_PCS0_O
#undef PTF16_LPUART12_TX_I
#undef PTF16_LPUART12_TX_O
#undef PTF17_ADC1_MA1
#undef PTF17_EMIOS_1_CH1_H_I
#undef PTF17_EMIOS_1_CH1_H_O
#undef PTF17_EMIOS_2_CH17_Y_I
#undef PTF17_EMIOS_2_CH17_Y_O
#undef PTF17_LPUART12_RX
#undef PTF18_ADC1_MA2
#undef PTF18_EMIOS_1_CH2_H_I
#undef PTF18_EMIOS_1_CH2_H_O
#undef PTF18_EMIOS_2_CH18_Y_I
#undef PTF18_EMIOS_2_CH18_Y_O
#undef PTF18_LPSPI3_PCS1_I
#undef PTF18_LPSPI3_PCS1_O
#undef PTF18_LPUART7_TX_I
#undef PTF18_LPUART7_TX_O
#undef PTF19_ADC0_MA2
#undef PTF19_EMIOS_1_CH3_H_I
#undef PTF19_EMIOS_1_CH3_H_O
#undef PTF19_EMIOS_2_CH19_Y_I
#undef PTF19_EMIOS_2_CH19_Y_O
#undef PTF19_HSE_TAMPER_LOOP_OUT0
#undef PTF19_LPSPI3_PCS2_I
#undef PTF19_LPSPI3_PCS2_O
#undef PTF19_LPUART7_RX
#undef PTF1_EIRQ1
#undef PTF1_EMIOS_2_CH1_H_I
#undef PTF1_EMIOS_2_CH1_H_O
#undef PTF1_LPSPI2_SIN_I
#undef PTF1_LPSPI2_SIN_O
#undef PTF1_LPUART5_RX
#undef PTF20_CAN0_TX
#undef PTF20_EMIOS_1_CH4_H_I
#undef PTF20_EMIOS_1_CH4_H_O
#undef PTF20_EMIOS_2_CH20_Y_I
#undef PTF20_EMIOS_2_CH20_Y_O
#undef PTF20_FXIO_D4_I
#undef PTF20_FXIO_D4_O
#undef PTF20_LPI2C0_SCL_I
#undef PTF20_LPI2C0_SCL_O
#undef PTF20_LPSPI3_PCS3_I
#undef PTF20_LPSPI3_PCS3_O
#undef PTF20_LPUART8_TX_I
#undef PTF20_LPUART8_TX_O
#undef PTF21_CAN0_RX
#undef PTF21_EMIOS_1_CH5_H_I
#undef PTF21_EMIOS_1_CH5_H_O
#undef PTF21_EMIOS_2_CH21_Y_I
#undef PTF21_EMIOS_2_CH21_Y_O
#undef PTF21_FXIO_D5_I
#undef PTF21_FXIO_D5_O
#undef PTF21_LPI2C0_SDA_I
#undef PTF21_LPI2C0_SDA_O
#undef PTF21_LPSPI1_PCS0_I
#undef PTF21_LPSPI1_PCS0_O
#undef PTF21_LPUART8_RX
#undef PTF22_EMIOS_1_CH6_H_I
#undef PTF22_EMIOS_1_CH6_H_O
#undef PTF22_EMIOS_2_CH22_X_I
#undef PTF22_EMIOS_2_CH22_X_O
#undef PTF22_LPSPI4_PCS2_I
#undef PTF22_LPSPI4_PCS2_O
#undef PTF23_EMIOS_1_CH7_H_I
#undef PTF23_EMIOS_1_CH7_H_O
#undef PTF23_EMIOS_2_CH23_X_I
#undef PTF23_EMIOS_2_CH23_X_O
#undef PTF23_LPSPI3_PCS3_I
#undef PTF23_LPSPI3_PCS3_O
#undef PTF23_LPUART9_TX_I
#undef PTF23_LPUART9_TX_O
#undef PTF24_EMIOS_1_CH8_X_I
#undef PTF24_EMIOS_1_CH8_X_O
#undef PTF24_LPUART9_RX
#undef PTF25_CAN2_TX
#undef PTF25_EMIOS_1_CH9_H_I
#undef PTF25_EMIOS_1_CH9_H_O
#undef PTF25_FXIO_D6_I
#undef PTF25_FXIO_D6_O
#undef PTF25_LPSPI2_PCS2_I
#undef PTF25_LPSPI2_PCS2_O
#undef PTF25_LPSPI4_PCS0_I
#undef PTF25_LPSPI4_PCS0_O
#undef PTF26_CAN2_RX
#undef PTF26_EMIOS_1_CH10_H_I
#undef PTF26_EMIOS_1_CH10_H_O
#undef PTF26_LPSPI2_PCS3_I
#undef PTF26_LPSPI2_PCS3_O
#undef PTF26_LPSPI4_PCS1_I
#undef PTF26_LPSPI4_PCS1_O
#undef PTF27_EMIOS_1_CH11_H_I
#undef PTF27_EMIOS_1_CH11_H_O
#undef PTF27_LPSPI4_PCS2_I
#undef PTF27_LPSPI4_PCS2_O
#undef PTF27_LPUART11_TX_I
#undef PTF27_LPUART11_TX_O
#undef PTF28_EMIOS_1_CH12_H_I
#undef PTF28_EMIOS_1_CH12_H_O
#undef PTF28_FXIO_D7_I
#undef PTF28_FXIO_D7_O
#undef PTF28_LPSPI0_PCS0_I
#undef PTF28_LPSPI0_PCS0_O
#undef PTF28_LPSPI4_PCS3_I
#undef PTF28_LPSPI4_PCS3_O
#undef PTF28_LPUART11_RX
#undef PTF28_TRACE_ETM_D5
#undef PTF29_ADC1_MA0
#undef PTF29_CAN3_TX
#undef PTF29_EMIOS_1_CH13_H_I
#undef PTF29_EMIOS_1_CH13_H_O
#undef PTF29_FXIO_D8_I
#undef PTF29_FXIO_D8_O
#undef PTF29_LPSPI3_PCS1_I
#undef PTF29_LPSPI3_PCS1_O
#undef PTF2_EIRQ2
#undef PTF2_EMIOS_2_CH2_H_I
#undef PTF2_EMIOS_2_CH2_H_O
#undef PTF2_LPSPI2_SOUT_I
#undef PTF2_LPSPI2_SOUT_O
#undef PTF2_LPUART6_TX_I
#undef PTF2_LPUART6_TX_O
#undef PTF30_ADC1_MA1
#undef PTF30_CAN3_RX
#undef PTF30_EMIOS_1_CH14_H_I
#undef PTF30_EMIOS_1_CH14_H_O
#undef PTF31_ADC1_MA2
#undef PTF31_EMIOS_1_CH15_H_I
