zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K342_K341_K322_100HDQFP-pinctrl.h
#undef PTF31_EMIOS_1_CH15_H_O
#undef PTF31_FXIO_D9_I
#undef PTF31_FXIO_D9_O
#undef PTF31_TRACE_ETM_D3
#undef PTF3_EIRQ3
#undef PTF3_EMIOS_2_CH3_H_I
#undef PTF3_EMIOS_2_CH3_H_O
#undef PTF3_LPSPI2_PCS0_I
#undef PTF3_LPSPI2_PCS0_O
#undef PTF3_LPUART6_RX
#undef PTF4_CAN5_TX
#undef PTF4_EIRQ4
#undef PTF4_EMIOS_2_CH4_H_I
#undef PTF4_EMIOS_2_CH4_H_O
#undef PTF4_FXIO_D0_I
#undef PTF4_FXIO_D0_O
#undef PTF5_CAN5_RX
#undef PTF5_EIRQ5
#undef PTF5_EMIOS_2_CH5_H_I
#undef PTF5_EMIOS_2_CH5_H_O
#undef PTF6_EIRQ6
#undef PTF6_EMIOS_2_CH6_H_I
#undef PTF6_EMIOS_2_CH6_H_O
#undef PTF7_EIRQ7
#undef PTF7_EMIOS_2_CH7_H_I
#undef PTF7_EMIOS_2_CH7_H_O
#undef PTF7_FXIO_D1_I
#undef PTF7_FXIO_D1_O
#undef PTF7_LPI2C1_SCL_I
#undef PTF7_LPI2C1_SCL_O
#undef PTF8_EIRQ16
#undef PTF8_EMIOS_2_CH8_X_I
#undef PTF8_EMIOS_2_CH8_X_O
#undef PTF8_FXIO_D2_I
#undef PTF8_FXIO_D2_O
#undef PTF8_LPI2C1_SDA_I
#undef PTF8_LPI2C1_SDA_O
#undef PTF9_ADC0_MA0
#undef PTF9_EIRQ17
#undef PTF9_EMIOS_2_CH9_H_I
#undef PTF9_EMIOS_2_CH9_H_O
#undef PTG0_EIRQ8
#undef PTG0_EMIOS_1_CH16_X_I
#undef PTG0_EMIOS_1_CH16_X_O
#undef PTG0_LPUART13_TX_I
#undef PTG0_LPUART13_TX_O
#undef PTG10_EIRQ26
#undef PTG11_EIRQ27
#undef PTG12_EIRQ28
#undef PTG12_LPSPI4_PCS3_I
#undef PTG12_LPSPI4_PCS3_O
#undef PTG13_CAN5_TX
#undef PTG13_EIRQ29
#undef PTG13_FXIO_D13_I
#undef PTG13_FXIO_D13_O
#undef PTG14_CAN5_RX
#undef PTG14_EIRQ30
#undef PTG15_EIRQ31
#undef PTG15_EMIOS_2_CH15_H_I
#undef PTG15_EMIOS_2_CH15_H_O
#undef PTG15_FXIO_D14_I
#undef PTG15_FXIO_D14_O
#undef PTG15_TRACE_ETM_D1
#undef PTG16_EMIOS_2_CH16_X_I
#undef PTG16_EMIOS_2_CH16_X_O
#undef PTG16_FXIO_D15_I
#undef PTG16_FXIO_D15_O
#undef PTG16_TRACE_ETM_D2
#undef PTG17_EMIOS_2_CH17_Y_I
#undef PTG17_EMIOS_2_CH17_Y_O
#undef PTG17_FXIO_D16_I
#undef PTG17_FXIO_D16_O
#undef PTG17_TRACE_ETM_D4
#undef PTG18_EMIOS_2_CH18_Y_I
#undef PTG18_EMIOS_2_CH18_Y_O
#undef PTG18_FXIO_D17_I
#undef PTG18_FXIO_D17_O
#undef PTG18_TRACE_ETM_D6
#undef PTG19_EMIOS_2_CH19_Y_I
#undef PTG19_EMIOS_2_CH19_Y_O
#undef PTG19_FXIO_D18_I
#undef PTG19_FXIO_D18_O
#undef PTG19_TRACE_ETM_D7
#undef PTG1_EIRQ9
#undef PTG1_EMIOS_1_CH17_Y_I
#undef PTG1_EMIOS_1_CH17_Y_O
#undef PTG1_LPUART13_RX
#undef PTG20_EMIOS_2_CH20_Y_I
#undef PTG20_EMIOS_2_CH20_Y_O
#undef PTG20_FXIO_D19_I
#undef PTG20_FXIO_D19_O
#undef PTG20_TRACE_ETM_D8
#undef PTG21_EMIOS_2_CH21_Y_I
#undef PTG21_EMIOS_2_CH21_Y_O
#undef PTG21_FXIO_D20_I
#undef PTG21_FXIO_D20_O
#undef PTG21_TRACE_ETM_D9
#undef PTG22_EMIOS_2_CH22_X_I
#undef PTG22_EMIOS_2_CH22_X_O
#undef PTG22_FXIO_D21_I
#undef PTG22_FXIO_D21_O
#undef PTG22_TRACE_ETM_D10
#undef PTG23_EMIOS_2_CH23_X_I
#undef PTG23_EMIOS_2_CH23_X_O
#undef PTG23_FXIO_D22_I
#undef PTG23_FXIO_D22_O
#undef PTG23_TRACE_ETM_D11
#undef PTG24_FXIO_D23_I
#undef PTG24_FXIO_D23_O
#undef PTG24_TRACE_ETM_D12
#undef PTG25_FXIO_D24_I
#undef PTG25_FXIO_D24_O
#undef PTG25_TRACE_ETM_D13
#undef PTG26_FXIO_D25_I
#undef PTG26_FXIO_D25_O
#undef PTG26_TRACE_ETM_D14
#undef PTG27_FXIO_D26_I
#undef PTG27_FXIO_D26_O
#undef PTG27_TRACE_ETM_D15
#undef PTG2_EIRQ10
#undef PTG2_EMIOS_1_CH18_Y_I
#undef PTG2_EMIOS_1_CH18_Y_O
#undef PTG2_LPUART14_TX_I
#undef PTG2_LPUART14_TX_O
#undef PTG3_EIRQ11
#undef PTG3_EMIOS_1_CH19_Y_I
#undef PTG3_EMIOS_1_CH19_Y_O
#undef PTG3_LPUART14_RX
#undef PTG4_CMP2_OUT
#undef PTG4_EIRQ12
#undef PTG4_EMIOS_1_CH20_Y_I
#undef PTG4_EMIOS_1_CH20_Y_O
#undef PTG4_LPUART15_TX_I
#undef PTG4_LPUART15_TX_O
#undef PTG5_CMP2_RR_ACTIVE
#undef PTG5_EIRQ13
#undef PTG5_EMIOS_1_CH21_Y_I
#undef PTG5_EMIOS_1_CH21_Y_O
#undef PTG5_LPUART15_RX
#undef PTG6_EIRQ14
#undef PTG6_EMIOS_1_CH22_X_I
#undef PTG6_EMIOS_1_CH22_X_O
#undef PTG6_FXIO_D10_I
#undef PTG6_FXIO_D10_O
#undef PTG6_TRACE_ETM_CLKOUT
#undef PTG7_EIRQ15
#undef PTG7_EMIOS_1_CH23_X_I
#undef PTG7_EMIOS_1_CH23_X_O
#undef PTG7_FXIO_D11_I
#undef PTG7_FXIO_D11_O
#undef PTG7_TRACE_ETM_D0
#undef PTG8_CAN4_TX
#undef PTG8_EIRQ24
#undef PTG8_FXIO_D12_I
#undef PTG8_FXIO_D12_O
#undef PTG9_CAN4_RX
#undef PTG9_EIRQ25
#undef TRGMUX_INT_OUT37_EMIOS_0_CH6_G
#undef TRGMUX_INT_OUT38_EMIOS_0_CH7_G

/* Signals specific to this part */
#define PTA15_LPUART1_DTR_B             NXP_SIUL2_PINMUX(0, 0, 15, 5, 0, 0)
#define PTA16_LPUART1_DSR_B             NXP_SIUL2_PINMUX(0, 0, 16, 0, 378, 1)
#define PTA6_LPUART0_RIN_B              NXP_SIUL2_PINMUX(0, 0, 6, 0, 375, 1)
#define PTA7_LPUART0_DCD_B              NXP_SIUL2_PINMUX(0, 0, 7, 0, 374, 1)
#define PTB10_LPUART0_DTR_B             NXP_SIUL2_PINMUX(0, 0, 42, 3, 0, 0)
#define PTB11_LPUART0_DSR_B             NXP_SIUL2_PINMUX(0, 0, 43, 0, 373, 2)
#define PTB12_LPUART0_DCD_B             NXP_SIUL2_PINMUX(0, 0, 44, 0, 374, 2)
#define PTB13_LPUART0_RIN_B             NXP_SIUL2_PINMUX(0, 0, 45, 0, 375, 2)
#define PTB8_LPUART1_DCD_B              NXP_SIUL2_PINMUX(0, 0, 40, 0, 377, 1)
#define PTB9_LPUART1_RIN_B              NXP_SIUL2_PINMUX(0, 0, 41, 0, 376, 1)
#define PTC10_LPUART0_DSR_B             NXP_SIUL2_PINMUX(0, 0, 74, 0, 373, 1)
#define PTC11_LPUART0_DTR_B             NXP_SIUL2_PINMUX(0, 0, 75, 2, 0, 0)
#define PTC17_FXIO_D2_I                 NXP_SIUL2_PINMUX(0, 0, 81, 0, 154, 10)
#define PTC17_FXIO_D2_O                 NXP_SIUL2_PINMUX(0, 0, 81, 7, 0, 0)
#define PTD6_FXIO_D3_I                  NXP_SIUL2_PINMUX(0, 0, 102, 0, 155, 9)
#define PTD6_FXIO_D3_O                  NXP_SIUL2_PINMUX(0, 0, 102, 2, 0, 0)
#define PTE12_CMP0_RR_ACTIVE            NXP_SIUL2_PINMUX(0, 0, 140, 1, 0, 0)
#define PTE12_FXIO_D7_I                 NXP_SIUL2_PINMUX(0, 0, 140, 0, 159, 9)
#define PTE12_FXIO_D7_O                 NXP_SIUL2_PINMUX(0, 0, 140, 7, 0, 0)
#define PTE12_SAI1_MCLK                 NXP_SIUL2_PINMUX(0, 0, 140, 0, 324, 2)
#define PTE3_SAI1_D0_I                  NXP_SIUL2_PINMUX(0, 0, 131, 0, 323, 2)
#define PTE3_SAI1_D0_O                  NXP_SIUL2_PINMUX(0, 0, 131, 2, 0, 0)

#endif /* _ZEPHYR_DTS_BINDING_S32K342_K341_K322_100HDQFP_WRAPPER_ */
